{
    "tab-title": "Jimy - Inicio",
    "works": "Trabajos",
    "work-exp": "Experiencia laboral",
    "welcome": "¡Hola, soy Jimy!",
    "subtitle": "Desarrollador Software",
    "about-title": "Sobre mí",
    "about-text": "Soy Juan Llinares, también conocido como Jimy, un apasionado de los coches y de la tecnología y siempre estoy buscando nuevos desafíos con los que mejorar mis habilidades. Actualmente estoy terminando mi grado en Ingeniería Informática en la Universidad de Alicante.",
    "my-portfolio": "Mi portfolio",
    "my-work-exp": "Mi experiencia laboral",
    "bio-title": "Biografía",
    "bio-item-1": "Nací en Villajoyosa",
    "bio-item-1-desc": "Un pequeño pueblo de la provincia de Alicante, España.",
    "bio-item-2": "Terminé el Bachillerato Científico",
    "bio-item-2-desc": "En el IES Marina Baixa, en Villajoyosa.",
    "bio-item-3": "Empecé el Grado en Ingeniería Informática",
    "bio-item-3-desc": "En la Universidad de Alicante.",
    "I-love-title": "Me encanta",
    "I-love-text": "Programar, los coches, el diseño gráfico, la música y el Machine Learning.",
    "homepage-item-1": "¡Mi página!",
    "homepage-item-1-desc": "Página personal de Jimy.",
    "homepage-item-1-large": "Mi página personal. La he creado para mostrar mis trabajos y proyectos, y para que puedas conocerme un poco mejor. ¡Espero que te guste!",
    "homepage-item-2": "Mi TFG",
    "homepage-item-2-desc": "Mi Trabajo de Fin de Grado en la UA.",
    "homepage-item-2-large": "Mi Trabajo de Fin de Grado en la Universidad de Alicante. Se trata de un proyecto de Machine Learning... COMPLETAR",
    "homepage-item-3": "Página web de Duskies",
    "homepage-item-3-desc": "Una página web para la crew Duskies.",
    "homepage-item-3-large": "Una página web para Duskies, una crew de coches modificados. En esta web puedes encontrar información sobre la crew, los coches, los miembros, los eventos y mucho más.",
    "homepage-item-3-large-2": "La página web fue realizada por:",
    "homepage-item-4": "ToDo App",
    "homepage-item-4-desc": "Mi ToDo App personal",
    "homepage-item-4-title": "Aplicación ToDo",
    "homepage-item-4-intro": "Esta página es una aplicación web ToDo moderna y sofisticada, combinando tecnologías de vanguardia tanto en el frontend como en el backend para proporcionar una experiencia de usuario fluida y atractiva. Aquí tienes un desglose detallado de las tecnologías utilizadas:",
    "homepage-item-4-frontend-title": "Frontend",
    "homepage-item-4-frontend-1": "Next.js 14: Un marco de React que proporciona renderizado del lado del servidor (SSR), generación de sitios estáticos (SSG) y enrutamiento basado en archivos.",
    "homepage-item-4-frontend-2": "React: Biblioteca de JavaScript para construir interfaces de usuario interactivas.",
    "homepage-item-4-frontend-3": "TypeScript: Un superconjunto de JavaScript que añade tipado estático, mejorando la robustez y mantenibilidad del código.",
    "homepage-item-4-frontend-4": "Tailwind CSS: Un marco de CSS primero en utilidades para estilizar rápidamente la aplicación.",
    "homepage-item-4-frontend-5": "react-draggable: Una biblioteca para implementar funcionalidad de arrastrar y soltar en elementos de tarea.",
    "homepage-item-4-backend-title": "Backend",
    "homepage-item-4-backend-1": "Supabase: Una plataforma de backend como servicio (BaaS) que proporciona base de datos PostgreSQL y autenticación.",
    "homepage-item-4-features-title": "Características Principales",
    "homepage-item-4-features-1": "Diseño responsivo: La aplicación se adapta tanto a dispositivos móviles como de escritorio.",
    "homepage-item-4-features-2": "Interfaz de usuario dinámica: Las tareas se pueden arrastrar y soltar en la versión de escritorio.",
    "homepage-item-4-features-3": "Clasificación de tareas: Los usuarios pueden asignar categorías a las tareas y filtrarlas.",
    "homepage-item-4-features-4": "Priorización de tareas: Las tareas se pueden marcar con diferentes niveles de importancia.",
    "homepage-item-4-features-5": "Persistencia de datos: Todas las tareas y sus estados se almacenan en la base de datos de Supabase.",
    "homepage-item-4-deployment-title": "Despliegue",
    "homepage-item-4-deployment-desc": "La aplicación probablemente está desplegada en la plataforma Vercel, que se integra sin problemas con Next.js y ofrece despliegues automáticos y vistas previas para cada commit.",
    "homepage-item-5-title": "a-Lex",
    "homepage-item-5-desc": "Web de alineaciones de coches de drift!",
    "homepage-item-6-title": "Hangman",
    "homepage-item-6-desc": "Juego del ahorcado interactivo",
    "homepage-item-6-intro": "Hangman es un juego clásico del ahorcado implementado como una aplicación web moderna. Combina tecnologías de vanguardia para ofrecer una experiencia de juego interactiva y educativa.",
    "homepage-item-6-frontend-title": "Frontend",
    "homepage-item-6-frontend-1": "Next.js 13+: Framework de React que proporciona renderizado del lado del servidor (SSR) y enrutamiento basado en archivos.",
    "homepage-item-6-frontend-2": "React: Biblioteca de JavaScript para construir interfaces de usuario interactivas.",
    "homepage-item-6-frontend-3": "TypeScript: Superconjunto de JavaScript que añade tipado estático.",
    "homepage-item-6-frontend-4": "Tailwind CSS: Framework de CSS para estilizar rápidamente la aplicación.",
    "homepage-item-6-frontend-5": "Lucide React: Biblioteca de iconos para mejorar la interfaz de usuario.",
    "homepage-item-6-backend-title": "Backend",
    "homepage-item-6-backend-1": "Supabase: Plataforma de backend como servicio (BaaS) que proporciona base de datos PostgreSQL.",
    "homepage-item-6-features-title": "Características Principales",
    "homepage-item-6-features-1": "Generación aleatoria de palabras: Utiliza la biblioteca 'random-words' para seleccionar palabras de juego.",
    "homepage-item-6-features-2": "Diccionario interactivo: Muestra definiciones de las palabras jugadas utilizando la API de Dictionary.",
    "homepage-item-6-features-3": "Componente arrastrable: El diccionario se puede mover por la pantalla para una mejor experiencia de usuario.",
    "homepage-item-6-features-4": "Persistencia de datos: Las palabras jugadas se almacenan en la base de datos de Supabase.",
    "homepage-item-6-features-5": "Interfaz de usuario dinámica: Actualización en tiempo real del estado del juego y visualización del ahorcado.",
    "homepage-item-6-deployment-title": "Despliegue",
    "homepage-item-6-deployment-desc": "La aplicación está desplegada en la plataforma Vercel, que se integra perfectamente con Next.js y ofrece despliegues automáticos.",
    "homepage-item-7-title": "Memoji-my",
    "homepage-item-7-desc": "Un juego de memoria divertido e interactivo",
    "homepage-item-7-intro": "Memoji-my es un juego de memoria atractivo desarrollado con Next.js y React. Utiliza avatares generados dinámicamente a través de la API de Dicebear para crear una experiencia única en cada partida.",
    "homepage-item-7-features-title": "Características Principales",
    "homepage-item-7-features-1": "Generación Dinámica de Avatares: Utiliza la API de Dicebear para crear avatares únicos en cada juego.",
    "homepage-item-7-features-2": "Múltiples Estilos de Avatar: Los jugadores pueden elegir entre una amplia variedad de estilos de avatar.",
    "homepage-item-7-features-3": "Interfaz Responsiva: Diseñada para funcionar tanto en dispositivos móviles como de escritorio.",
    "homepage-item-7-features-4": "Modo Oscuro/Claro: Admite cambio de tema para una experiencia de usuario personalizada.",
    "homepage-item-7-features-5": "Animaciones Suaves: Transiciones y animaciones para una experiencia de juego fluida.",
    "homepage-item-7-tech-title": "Tecnologías Utilizadas",
    "homepage-item-7-tech-1": "Next.js: Framework de React para renderizado del lado del servidor y generación de sitios estáticos.",
    "homepage-item-7-tech-2": "React: Biblioteca de JavaScript para construir interfaces de usuario.",
    "homepage-item-7-tech-3": "TypeScript: Superconjunto tipado de JavaScript para un desarrollo más robusto.",
    "homepage-item-7-tech-4": "Tailwind CSS: Framework CSS de utilidad para un estilo rápido y personalizable.",
    "homepage-item-7-tech-5": "API de Dicebear: Servicio para generar avatares únicos.",
    "homepage-item-7-how-to-play-title": "Cómo Jugar",
    "homepage-item-7-how-to-play-1": "Selecciona un estilo de avatar del menú desplegable.",
    "homepage-item-7-how-to-play-2": "Haz clic en las cartas para revelar los avatares ocultos.",
    "homepage-item-7-how-to-play-3": "Encuentra todos los pares de avatares coincidentes.",
    "homepage-item-7-how-to-play-4": "Gana el juego una vez que se encuentren todos los pares.",
    "not-found": "Página no encontrada",
    "not-found-desc": "La página que buscas no existe.",
    "back-home": "Volver a inicio",
    "loading": "Cargando...",
    "social-title": "Mis redes sociales",
    "finished": "Finalizado",
    "in-progress": "En progreso",
    "cv-title": "Mi CV",
    "cv-desc": "¡Descarga mi CV aquí!"
}