{
    "tab-title": "Jimy - Homepage",
    "works": "Works",
    "work-exp": "Work Experience",
    "welcome": "Hello! I'm Jimy!",
    "subtitle": "Software Developer",
    "about-title": "About me",
    "about-text": "I am Juan Llinares, also known as Jimy, passionate about cars and technology, and always looking for new challenges to improve my skills. I am currently finishing my degree in Computer Science at the University of Alicante.",
    "my-portfolio": "My portfolio",
    "my-work-exp": "My Work Experience",
    "bio-title": "Biography",
    "bio-item-1": "Born in Villajoyosa",
    "bio-item-1-desc": "A small town in the province of Alicante, Spain.",
    "bio-item-2": "Finished Scientific High School",
    "bio-item-2-desc": "In the IES Marina Baixa, at Villajoyosa.",
    "bio-item-3": "Started Computer Science Degree",
    "bio-item-3-desc": "At the University of Alicante.",
    "I-love-title": "I love",
    "I-love-text": "Programming, cars, graphic design, music, and Machine Learning.",
    "homepage-item-1": "My homepage!",
    "homepage-item-1-desc": "Jimy's personal page.",
    "homepage-item-1-large": "My personal page. I have created it to show my works and projects, and for you to get to know me a little better. I hope you like it!",
    "homepage-item-2": "My Final Degree Project",
    "homepage-item-2-desc": "My Final Degree Project at the University of Alicante.",
    "homepage-item-2-large": "My Final Degree Project at the University of Alicante. It is a Machine Learning project... COMPLETAR",
    "homepage-item-3": "Duskies Webpage",
    "homepage-item-3-desc": "A webpage for the crew Duskies.",
    "homepage-item-3-large": "A webpage for Duskies, a crew of modified cars. In this website you can find information about the crew, the cars, the members, the events, and much more.",
    "homepage-item-3-large-2": "The webpage was made by:",
    "homepage-item-4-title": "ToDo App",
    "homepage-item-4-desc": "My Personal ToDo App",
    "homepage-item-4-intro": "This page is a modern and sophisticated ToDo web application, combining cutting-edge technologies in both the frontend and backend to provide a smooth and engaging user experience. Here's a detailed breakdown of the technologies used:",
    "homepage-item-4-frontend-title": "Frontend",
    "homepage-item-4-frontend-1": "Next.js 14: A React framework providing server-side rendering (SSR), static site generation (SSG), and file-based routing.",
    "homepage-item-4-frontend-2": "React: JavaScript library for building interactive user interfaces.",
    "homepage-item-4-frontend-3": "TypeScript: A superset of JavaScript adding static typing, improving code robustness and maintainability.",
    "homepage-item-4-frontend-4": "Tailwind CSS: A utility-first CSS framework for quickly styling the application.",
    "homepage-item-4-frontend-5": "react-draggable: A library to implement drag-and-drop functionality in task elements.",
    "homepage-item-4-backend-title": "Backend",
    "homepage-item-4-backend-1": "Supabase: A backend-as-a-service (BaaS) platform providing PostgreSQL database and authentication.",
    "homepage-item-4-features-title": "Main Features",
    "homepage-item-4-features-1": "Responsive design: The app adapts to both mobile and desktop devices.",
    "homepage-item-4-features-2": "Dynamic user interface: Tasks can be dragged and dropped in the desktop version.",
    "homepage-item-4-features-3": "Task categorization: Users can assign categories to tasks and filter by them.",
    "homepage-item-4-features-4": "Task prioritization: Tasks can be marked with different levels of importance.",
    "homepage-item-4-features-5": "Data persistence: All tasks and their states are stored in the Supabase database.",
    "homepage-item-4-deployment-title": "Deployment",
    "homepage-item-4-deployment-desc": "The application is likely deployed on the Vercel platform, which integrates seamlessly with Next.js and offers automatic deployments and previews for every commit.",
    "not-found": "Page not found",
    "not-found-desc": "The page you are looking for does not exist.",
    "back-home": "Back to home",
    "loading": "Loading...",
    "social-title": "My social networks",
    "finished": "Finished",
    "in-progress": "In progress",
    "cv-title": "My CV",
    "cv-desc": "Download my CV here!"
}